Infineon/PSoC6-101-Video-Projects/PSoC 6_101/RemoteControl.cydsn/Generated_Source/PSoC6/CapSense_Structure.h
/***************************************************************************//**
* \file CapSense_Structure.h
* \version 2.0
*
* \brief
*   This file provides the top level declarations of the component data structure.
*   Also, the file declares the high-level and low-level APIs for data access.
*
* \see CapSense v2.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_SENSE_CapSense_STRUCTURE_H)
#define CY_SENSE_CapSense_STRUCTURE_H

#include "syslib/cy_syslib.h"
#include "cyfitter.h"
#include "CapSense_Configuration.h"
#if (CapSense_CSD_SS_DIS != CapSense_CSD_AUTOTUNE)
    #include "CapSense_SmartSense_LL.h"
#endif

#if (CapSense_ENABLE == CapSense_ALP_FILTER_EN)
    #include "CapSense_AlpFilter_LL.h"
#endif

#if ((CapSense_ENABLE == CapSense_GES_GLOBAL_EN) ||\
     (CapSense_ENABLE == CapSense_BALLISTIC_MULTIPLIER_EN))
    #include "CapSense_TMG.h"
#endif

#if (CapSense_ENABLE == CapSense_CENTROID_5X5_CSD_EN)
    #include "CapSense_AdvancedCentroid_LL.h"
#endif

#if (CapSense_ENABLE == CapSense_POS_ADAPTIVE_IIR_FILTER_EN)
    #include "CapSense_AdaptiveFilter_LL.h"
#endif

/*******************************************************************************
* Constant Definitions
*******************************************************************************/

/* Defines size of Sensor Status Register in Data Structure */
#define CapSense_SNS_STS_TYPE               uint8

/* No touch condition for slider position report */
#define CapSense_SLIDER_NO_TOUCH            (0xFFFFu)
#define CapSense_TOUCHPAD_NO_TOUCH          (0xFFFFFFFFLu)

#define CapSense_SLIDER_POS_NONE            (0xFFFFu)
#define CapSense_TOUCHPAD_POS_NONE          (0xFFFFu)

#define CapSense_MATRIX_POS_NONE            (0xFFu)
#define CapSense_MATRIX_POS_MULTI           (0xFEu)

#define CapSense_PROX_STS_MASK              (3Lu)
#define CapSense_PROX_STS_OFFSET(proxId)    ((proxId) << 1u)

#define CapSense_MATRIX_BUTTONS_TOUCHED     (0x80000000Lu)

/*******************************************************************************
* Enumeration types definition
*******************************************************************************/

/***************************************************************************//**
* \brief Defines widget types
*******************************************************************************/
typedef enum
{
    CapSense_WD_BUTTON_E        = 0x01u,
    CapSense_WD_LINEAR_SLIDER_E = 0x02u,
    CapSense_WD_RADIAL_SLIDER_E = 0x03u,
    CapSense_WD_MATRIX_BUTTON_E = 0x04u,
    CapSense_WD_TOUCHPAD_E      = 0x05u,
    CapSense_WD_PROXIMITY_E     = 0x06u
} CapSense_WD_TYPE_ENUM;


/***************************************************************************//**
* \brief Defines sensing methods types
*******************************************************************************/
typedef enum
{
    CapSense_UNDEFINED_E            = 0x00u,
    CapSense_SENSE_METHOD_CSD_E     = 0x01u,
    CapSense_SENSE_METHOD_CSX_E     = 0x02u,
    CapSense_SENSE_METHOD_BIST_E    = 0x03u
} CapSense_SENSE_METHOD_ENUM;

/***************************************************************************//**
* \brief Defines electrode types
*******************************************************************************/
typedef enum
{
    CapSense_ELTD_TYPE_SELF_E   = 0x01u,
    CapSense_ELTD_TYPE_MUT_TX_E = 0x02u,
    CapSense_ELTD_TYPE_MUT_RX_E = 0x03u
} CapSense_ELTD_TYPE_ENUM;

/**
* \cond SECTION_STRUCTURES
* \addtogroup group_structures
* \{
*/
/*******************************************************************************
* Declares RAM structures for all used widgets
*******************************************************************************/

/***************************************************************************//**
* \brief Declares common widget RAM parameters
*******************************************************************************/
typedef struct
{
    /**
     *  Provides scan resolution for the CSD Widgets.
     *  Provides number of the sub-conversions for the CSX Widgets.
     */
    uint16 resolution;

    /**
     *  Widget Finger Threshold.
     */
    CapSense_THRESHOLD_TYPE fingerTh;

    /**
     *  Widget Noise Threshold.
     */
    uint8  noiseTh;

    /**
     *  Widget Negative Noise Threshold.
     */
    uint8  nNoiseTh;

    /**
     *  Widget Hysteresis for the signal crossing finger threshold.
     */
    uint8  hysteresis;

    /**
     *  Widget Debounce for the signal above the finger threshold. OFF to ON.
     */
    uint8  onDebounce;

    /**
     *  The widget low baseline reset count.
     *  Specifies the number of samples the sensor signal must be below the Negative 
     *  Noise Threshold to trigger a baseline reset.
     */
    CapSense_LOW_BSLN_RST_TYPE lowBslnRst;

    /**
     *  Sets the current of the modulation IDAC for the CSD widgets. 
     *  For the CSD Touchpad and Matrix Button widgets sets the current of the 
     *  modulation IDAC for the column sensors.
     *  Not used for the CSX widgets.
     */
    uint8  idacMod [CapSense_NUM_SCAN_FREQS];

    /**
     *  Specifies the sense clock divider. Present only if individual clock 
     *  dividers are enabled.
     *  Specifies the sense clock divider for the Column sensors for the Matrix Buttons
     *  and Touchpad widgets.
     *  Sets Tx clock divider for the CSX Widgets.
     */
    uint16 snsClk;

    /**
     *  Register for internal use
     */
    uint8  snsClkSource;

    /**
     *  Widget Finger capacitance parameter. Available only if the 
     *  SmartSense is enabled.
     *  Not used for the CSX Widgets.
     */
    uint16 fingerCap;

    /**
     *  The 75% of signal per user-defined finger capacitance
     */
    uint16 sigPFC;
} CapSense_RAM_WD_BASE_STRUCT;

/***************************************************************************//**
* \brief Declares RAM parameters for the Slider
*******************************************************************************/
typedef struct
{
    /**
     *  Provides scan resolution for the CSD Widgets.
     *  Provides number of the sub-conversions for the CSX Widgets.
     */
    uint16 resolution;

    /**
     *  Widget Finger Threshold.
     */
    CapSense_THRESHOLD_TYPE fingerTh;

    /**
     *  Widget Noise Threshold.
     */
    uint8  noiseTh;

    /**
     *  Widget Negative Noise Threshold.
     */
    uint8  nNoiseTh;

    /**
     *  Widget Hysteresis for the signal crossing finger threshold.
     */
    uint8  hysteresis;

    /**
     *  Widget Debounce for the signal above the finger threshold. OFF to ON.
     */
    uint8  onDebounce;

    /**
     *  The widget low baseline reset count.
     *  Specifies the number of samples the sensor signal must be below the Negative 
     *  Noise Threshold to trigger a baseline reset.
     */
    CapSense_LOW_BSLN_RST_TYPE lowBslnRst;

    /**
     *  Sets the current of the modulation IDAC for the CSD widgets. 
     *  For the CSD Touchpad and Matrix Button widgets sets the current of the 
     *  modulation IDAC for the column sensors.
     *  Not used for the CSX widgets.
     */
    uint8  idacMod [CapSense_NUM_SCAN_FREQS];

    /**
     *  Specifies the sense clock divider. Present only if individual clock 
     *  dividers are enabled.
     *  Specifies the sense clock divider for the Column sensors for the Matrix Buttons
     *  and Touchpad widgets.
     *  Sets Tx clock divider for the CSX Widgets.
     */
    uint16 snsClk;

    /**
     *  Register for internal use
     */
    uint8  snsClkSource;

    /**
     *  Widget Finger capacitance parameter. Available only if the 
     *  SmartSense is enabled.
     *  Not used for the CSX Widgets.
     */
    uint16 fingerCap;

    /**
     *  The 75% of signal per user-defined finger capacitance
     */
    uint16 sigPFC;

    /**
     *  Reports the widget position.
     */
    uint16 position [CapSense_NUM_CENTROIDS];
} CapSense_RAM_WD_SLIDER_STRUCT;

/***************************************************************************//**
* \brief Declares RAM parameters for the CSX Button
*******************************************************************************/
typedef struct
{
    /**
     *  Provides scan resolution for the CSD Widgets.
     *  Provides number of the sub-conversions for the CSX Widgets.
     */
    uint16 resolution;

    /**
     *  Widget Finger Threshold.
     */
    CapSense_THRESHOLD_TYPE fingerTh;

    /**
     *  Widget Noise Threshold.
     */
    uint8  noiseTh;

    /**
     *  Widget Negative Noise Threshold.
     */
    uint8  nNoiseTh;

    /**
     *  Widget Hysteresis for the signal crossing finger threshold.
     */
    uint8  hysteresis;

    /**
     *  Widget Debounce for the signal above the finger threshold. OFF to ON.
     */
    uint8  onDebounce;

    /**
     *  The widget low baseline reset count.
     *  Specifies the number of samples the sensor signal must be below the Negative 
     *  Noise Threshold to trigger a baseline reset.
     */
    CapSense_LOW_BSLN_RST_TYPE lowBslnRst;

    /**
     *  Sets the current of the modulation IDAC for the CSD widgets. 
     *  For the CSD Touchpad and Matrix Button widgets sets the current of the 
     *  modulation IDAC for the column sensors.
     *  Not used for the CSX widgets.
     */
    uint8  idacMod [CapSense_NUM_SCAN_FREQS];

    /**
     *  Specifies the sense clock divider. Present only if individual clock 
     *  dividers are enabled.
     *  Specifies the sense clock divider for the Column sensors for the Matrix Buttons
     *  and Touchpad widgets.
     *  Sets Tx clock divider for the CSX Widgets.
     */
    uint16 snsClk;

    /**
     *  Register for internal use
     */
    uint8  snsClkSource;

    /**
     *  Widget Finger capacitance parameter. Available only if the 
     *  SmartSense is enabled.
     *  Not used for the CSX Widgets.
     */
    uint16 fingerCap;

    /**
     *  The 75% of signal per user-defined finger capacitance
     */
    uint16 sigPFC;
} CapSense_RAM_WD_BUTTON_STRUCT;


/***************************************************************************//**
* \brief Declares RAM structure with all defined widgets
*******************************************************************************/
typedef struct
{
    /**
     *  LinearSlider0 widget RAM structure
     */
    CapSense_RAM_WD_SLIDER_STRUCT linearslider0;

    /**
     *  Button0 widget RAM structure
     */
    CapSense_RAM_WD_BUTTON_STRUCT button0;

    /**
     *  Button1 widget RAM structure
     */
    CapSense_RAM_WD_BUTTON_STRUCT button1;
} CapSense_RAM_WD_LIST_STRUCT;


/***************************************************************************//**
* \brief Declares RAM structure for sensors
*******************************************************************************/
typedef struct
{
    /**
     *  The sensor raw counts.
     */
    uint16 raw [CapSense_NUM_SCAN_FREQS];

    /**
     *  The sensor baseline.
     */
    uint16 bsln [CapSense_NUM_SCAN_FREQS];

    /**
     *  For the bucket baseline algorithm holds the bucket state,
     *  For the IIR baseline keeps LSB of the baseline value.
     */
    uint8  bslnExt [CapSense_NUM_SCAN_FREQS];

    /**
     *  Sensor differences.
     */
    CapSense_THRESHOLD_TYPE diff;

    /**
     *  The baseline reset counter for the low baseline reset function.
     */
    CapSense_LOW_BSLN_RST_TYPE negBslnRstCnt [CapSense_NUM_SCAN_FREQS];

    /**
     *  CSD Widgets: The compensation IDAC value.
     *  CSX Widgets: The balancing IDAC value.
     */
    uint8  idacComp [CapSense_NUM_SCAN_FREQS];
} CapSense_RAM_SNS_STRUCT;


/***************************************************************************//**
* \brief Declares RAM structure with all defined sensors
*******************************************************************************/
typedef struct
{
    /**
     *  LinearSlider0 sensors RAM structures array
     */
    CapSense_RAM_SNS_STRUCT linearslider0 [CapSense_LINEARSLIDER0_NUM_SENSORS];

    /**
     *  Button0 sensors RAM structures array
     */
    CapSense_RAM_SNS_STRUCT button0       [CapSense_BUTTON0_NUM_SENSORS];

    /**
     *  Button1 sensors RAM structures array
     */
    CapSense_RAM_SNS_STRUCT button1       [CapSense_BUTTON1_NUM_SENSORS];
} CapSense_RAM_SNS_LIST_STRUCT;


/***************************************************************************//**
* \brief Declares the top-level RAM Data Structure
*******************************************************************************/
typedef struct
{
    /**
     *  16-bit CRC calculated by the customizer for the component 
     *  configuration. 
     *  Used by the Tuner application to identify if the FW corresponds to the 
     *  specific user configuration.
     */
    uint16 configId;

    /**
     *  Used by the Tuner application to identify device-specific configuration.
     */
    uint16 deviceId;

    /**
     *  Used by the Tuner application to identify the system clock frequency.
     */
    uint16 hwClock;

    /**
     *  Tuner Command Register. 
     *  Used for the communication between the Tuner GUI and the component.
     */
    uint16 tunerCmd;

    /**
     *  This counter gets incremented after each scan.
     */
    uint16 scanCounter;

    /**
     *  Status information: Current Widget, Scan active, Error code.
     */
    volatile uint32 status;

    /**
     *  The bitmask that sets which Widgets are enabled and scanned, 
     *  each bit corresponds to one widget.
     */
    uint32 wdgtEnable [CapSense_WDGT_STATUS_WORDS];

    /**
     *  The bitmask that reports activated Widgets (widgets that detect 
     *  a touch signal above the threshold), each bit corresponds to one widget.
     */
    uint32 wdgtStatus [CapSense_WDGT_STATUS_WORDS];

    /**
     *  For Buttons, Sliders, Matrix Buttons and CSD Touchpad each bit 
     *  reports status of the individual sensor of the widget:
     *  1 - active (above the finger threshold);
     *  0 - inactive;
     *  For the CSD Touchpad and CSD Matrix Buttons, the column sensors occupy the 
     *  least significant bits.
     *  For the Proximity widget, each sensor uses two bits with the following meaning:
     *  00 - Not active;
     *  01 - Proximity detected (signal above finger threshold);
     *  11 - A finger touch detected (signal above the touch threshold);
     *  For the CSX Touchpad Widget, this register provides a number of the detected 
     *  touches. The array size is equal to the total number of widgets. The size of the array 
     *  element depends on the max number of sensors per widget used in the current design. 
     *  It could be 1, 2 or 4 bytes.
     */
    CapSense_SNS_STS_TYPE snsStatus [CapSense_TOTAL_WIDGETS];

    /**
     *  The configuration register for global parameters of the CSD0 block.
     */
    uint16 csd0Config;

    /**
     *  The modulator clock divider for the CSD widgets.
     */
    uint8  modCsdClk;

    /**
     *  The modulator clock divider for the CSX widgets.
     */
    uint8  modCsxClk;

    /**
     *  RAM Widget Objects.
     */
    CapSense_RAM_WD_LIST_STRUCT wdgtList;

    /**
     *  RAM Sensor Objects.
     */
    CapSense_RAM_SNS_LIST_STRUCT snsList;

    /**
     *  The selected widget ID.
     */
    uint8  snrTestWidgetId;

    /**
     *  The selected sensor ID.
     */
    uint8  snrTestSensorId;

    /**
     *  The scan counter.
     */
    uint16 snrTestScanCounter;

    /**
     *  The sensor raw counts.
     */
    uint16 snrTestRawCount [CapSense_NUM_SCAN_FREQS];
} CapSense_RAM_STRUCT;


/***************************************************************************//**
* \brief Declares the Flash IO object
*******************************************************************************/
typedef struct
{
    /**
     *  Pointer to the base port register of the IO.
     */
    GPIO_PRT_Type* pcPtr;

    /**
     *  Position of the IO in the port.
     */
    uint8    pinNumber;
} CapSense_FLASH_IO_STRUCT;


/***************************************************************************//**
* \brief Declares the Flash Electrode object
*******************************************************************************/
typedef struct
{
    /**
     *  Index of the first IO in the Flash IO Object Array.
     */
    uint16 firstPinId;

    /**
     *  Total number of IOs in this sensor.
     */
    uint8  numPins;

    /**
     * Sensor type:
     * - ELTD_TYPE_SELF_E - CSD sensor;
     * - ELTD_TYPE_MUT_TX_E - CSX Tx sensor;
     * - ELTD_TYPE_MUT_RX_E - CSX Rx sensor;
     */
    uint8  type;
} CapSense_FLASH_SNS_STRUCT;


/***************************************************************************//**
* \brief Declares the structure with all Flash electrode objects
*******************************************************************************/
typedef struct
{
    /**
     *  No ganged sensors available
     */
    uint8 notUsed;
} CapSense_FLASH_SNS_LIST_STRUCT;




/***************************************************************************//**
* \brief Declares Flash widget object
*******************************************************************************/
typedef struct
{
    /**
     *  Points to the array of the FLASH Sensor Objects or FLASH IO Objects that belong to this widget.
     *  Sensing block uses this pointer to access and configure IOs for the scanning.
     *  Bit #2 in WD_STATIC_CONFIG field indicates the type of array: 
     *  1 - Sensor Object; 
     *  0 - IO Object.
     */
    void const * ptr2SnsFlash;

    /**
     *  Points to the Widget Object in RAM. Sensing block uses it to 
     *  access scan parameters.
     *  Processing uses it to access threshold and widget specific data.
     */
    void * ptr2WdgtRam;

    /**
     *  Points to the array of Sensor Objects in RAM.
     *  The sensing and processing blocks use it to access the scan data.
     */
    CapSense_RAM_SNS_STRUCT * ptr2SnsRam;

    /**
     *  Points to the array of the Filter History Objects in RAM
     */
    void * ptr2FltrHistory;

    /**
     *  Points to the array of the debounce counters.
     *  The size of the debounce counter is 8 bits.
     *  These arrays are not part of the data structure.
     */
    uint8 * ptr2DebounceArr;

    /**
     *  Miscellaneous configuration flags.
     */
    uint32 staticConfig;

    /**
     *  The total number of sensors. 
     *  For CSD widgets: WD_NUM_ROWS + WD_NUM_COLS. 
     *  For CSX widgets: WD_NUM_ROWS * WD_NUM_COLS.
     */
    uint16 totalNumSns;

    /**
     *  Specifies one of the following widget types: 
     *  WD_BUTTON_E,
     *  WD_LINEAR_SLIDER_E,
     *  WD_RADIAL_SLIDER_E,
     *  WD_MATRIX_BUTTON_E, 
     *  WD_TOUCHPAD_E, 
     *  WD_PROXIMITY_E
     */
    uint8  wdgtType;

    /**
     *  Specifies the widget sensing method that could be either
     */
    uint8  senseMethod;

    /**
     *  For CSD Button and Proximity Widgets, the number of sensors.
     *  For CSD Slider Widget, the number of segments.
     *  For CSD Touchpad and Matrix Button, the number of the column sensors.
     *  For CSX Button, Touchpad and Matrix Button, the number of the Rx electrodes.
     */
    uint8  numCols;

    /**
     *  For CSD Touchpad and Matrix Buttons, the number of the row sensors.
     *  For the CSX Button, the number of the Tx electrodes (constant 1u).
     *  For CSX Touchpad and Matrix Button, the number of the Tx electrodes.
     */
    uint8  numRows;

    /**
     *  Sliders: The Linear/Angular resolution.
     *  Touchpad: The X-Axis resolution.
     */
    uint16 xResolution;

    /**
     *  The pre-calculated X resolution centroid multiplier used for 
     *  the X-axis position calculation.
     *  Calculated as follows:
     *  RADIAL: (WD_X_RESOLUTION * 256) / WD_NUM_COLS;
     *  LINEAR and TOUCHPAD: (WD_X_RESOLUTION * 256) / (WD_NUM_COLS - CONFIG);
     *  where CONFIG is 0 or 1 depends on CentroidMultiplerMethod parameter
     */
    uint32 xCentroidMultiplier;

    /**
     *  The pointer to the array with the sensor noise envelope data.
     *  Set to the valid value only for the CSD widgets.
     *  For the CSX widgets, this pointer is set to NULL.
     *  The pointed array is not part of the data structure.
     */
    SMARTSENSE_CSD_NOISE_ENVELOPE_STRUCT * ptr2NoiseEnvlp;

    /**
     *  The position IIR filter coefficient.
     */
    uint8  iirFilterCoeff;
} CapSense_FLASH_WD_STRUCT;


/***************************************************************************//**
* \brief Declares top-level Flash Data Structure
*******************************************************************************/
typedef struct
{
    /**
     *  Array of flash widget objects
     */
    CapSense_FLASH_WD_STRUCT wdgtArray[CapSense_TOTAL_WIDGETS];
} CapSense_FLASH_STRUCT;


