Infineon/PSoC6-101-Video-Projects/PSoC 6_101/RemoteControl.cydsn/Generated_Source/PSoC6/CapSense_Structure.h
#if (CapSense_ENABLE == CapSense_TST_BSLN_RAW_OUT_RANGE_EN)
    /***************************************************************************//**
    * \brief Defines the structure for test of baseline and raw count limits which
    * will be determined by user for every sensor grounding on the
    * manufacturing specific data
    *******************************************************************************/
    typedef struct
    {
        /**
         *  Upper limit of a sensor baseline.
         */
        uint16 bslnHiLim;
        /**
         *  Lower limit of a sensor baseline.
         */
        uint16 bslnLoLim;
        /**
         *  Upper limit of a sensor raw count.
         */
        uint16 rawHiLim;
        /**
         *  Lower limit of a sensor raw count.
         */
        uint16 rawLoLim;
    } CapSense_BSLN_RAW_RANGE_STRUCT;
#endif /* (CapSense_ENABLE == CapSense_TST_BSLN_RAW_OUT_RANGE_EN) */

/** \}
* \endcond */


/***************************************************************************//**
* Declares Dual-channel scan structure
*******************************************************************************/
typedef struct
{
    uint8 csd0WidgetId;
    uint8 csd0SensorId;
    uint8 csd1WidgetId;
    uint8 csd1SensorId;
} CapSense_SCAN_SLOT_STRUCT;


/***************************************************************************//**
* Declares Filter module structures
*******************************************************************************/

/***************************************************************************//**
* \brief Declares filter channel structure for regular sensors
*******************************************************************************/
typedef struct
{
    uint16 notUsed;
} CapSense_REGULAR_FLTR_CHANNEL_STRUCT;

/***************************************************************************//**
* \brief Declares filter structure for regular sensors
*******************************************************************************/
typedef struct
{
    /**
     *  Array of CapSense_REGULAR_FLTR_CHANNEL_STRUCT for each available scan frequency
     */
    CapSense_REGULAR_FLTR_CHANNEL_STRUCT regularChannel[CapSense_NUM_SCAN_FREQS];
} CapSense_REGULAR_FLTR_STRUCT;

/***************************************************************************//**
* \brief Declares union for filter structure variants
*******************************************************************************/
typedef union
{
    /**
     *  Pointer to void type
     */
    void *ptr;

    /**
     *  Pointer to CapSense_REGULAR_FLTR_STRUCT type
     */
    CapSense_REGULAR_FLTR_STRUCT *ptrRegular;
} CapSense_PTR_FILTER_VARIANT;


#if (0u != CapSense_POSITION_FILTER_EN)
typedef struct
{
    #if (0u != CapSense_POS_MEDIAN_FILTER_EN)
        uint16 posMedianZ1;
        uint16 posMedianZ2;
    #endif /* #if (0u != CapSense_POS_MEDIAN_FILTER_EN) */

    #if (0u != CapSense_POS_IIR_FILTER_EN)
        uint16 posIIR;
    #endif /* #if (0u != CapSense_POS_IIR_FILTER_EN) */

    #if (0u != CapSense_POS_ADAPTIVE_IIR_FILTER_EN)
        uint16 posAIIR;
    #endif /* (0u != CapSense_POS_ADAPTIVE_IIR_FILTER_EN) */

    #if (0u != CapSense_POS_AVERAGE_FILTER_EN)
        uint16 posAverage;
    #endif /* #if (0u != CapSense_POS_AVERAGE_FILTER_EN) */

    #if (0u != CapSense_POS_JITTER_FILTER_EN)
        uint16 posJitter;
    #endif /* #if (0u != CapSense_POS_JITTER_FILTER_EN) */

    #if (0u != CapSense_POS_ADAPTIVE_IIR_FILTER_EN)
        uint8 posAIIRCoeff;
    #endif /* (0u != CapSense_POS_ADAPTIVE_IIR_FILTER_EN) */
} CapSense_SLIDER_POS_HISTORY_STRUCT;

typedef struct
{
    CapSense_SLIDER_POS_HISTORY_STRUCT xPos;
    CapSense_SLIDER_POS_HISTORY_STRUCT yPos;
} CapSense_TOUCHPAD_POS_HISTORY_STRUCT;
#endif /* (0u != CapSense_POSITION_FILTER_EN) */

/*******************************************************************************
* API Constants
*******************************************************************************/

/*******************************************************************************
* Defines shift/mask values for data structure register bit fields
*******************************************************************************/

/* CSD0_CONFIG bit fields */

/* Bit 0: The multi-frequency scan enable/disable at runtime. This bit is functional
 * only if the multi-frequency scan functionality has been activated
 * in general component configuration. */
#define CapSense_MULTI_FREQ_EN_SIZE       (0x00000001Lu)
#define CapSense_MULTI_FREQ_EN_SHIFT      (0u)
#define CapSense_MULTI_FREQ_EN_MASK       (CapSense_MULTI_FREQ_EN_SIZE << CapSense_MULTI_FREQ_EN_SHIFT)

/* Bit 1: The sensor auto-reset is enabled */
#define CapSense_SNS_ARST_SIZE            (0x00000001Lu)
#define CapSense_SNS_ARST_SHIFT           (1u)
#define CapSense_SNS_ARST_MASK            (CapSense_SNS_ARST_SIZE << CapSense_SNS_ARST_SHIFT)

/* Bits 2-3: The IDAC range setting (4x/8x) */
#define CapSense_IDAC_RANGE_SIZE          (0x00000003Lu)
#define CapSense_IDAC_RANGE_SHIFT         (2u)
#define CapSense_IDAC_RANGE_MASK          (CapSense_IDAC_RANGE_SIZE << CapSense_IDAC_RANGE_SHIFT)

/* Bits 4-7: Reserved */

/* Bit 8: The shield electrode signal Enable/Disable */
#define CapSense_SHLD_EN_SIZE             (0x00000001Lu)
#define CapSense_SHLD_EN_SHIFT            (8u)
#define CapSense_SHLD_EN_MASK             (CapSense_SHLD_EN_SIZE << CapSense_SHLD_EN_SHIFT)

/* Bits 9-10: Selects the delay by which the csd_shield is delayed relative to csd_sense */
#define CapSense_SHLD_DLY_SIZE            (0x00000003Lu)
#define CapSense_SHLD_DLY_SHIFT           (9u)
#define CapSense_SHLD_DLY_MASK            (CapSense_SHLD_DLY_SIZE << CapSense_SHLD_DLY_SHIFT)


/* STATUS bit fields */

/* Bits 0-6: The widget currently selected for CSD0 */
#define CapSense_STATUS_WDGT0_SIZE        (0x0000007FLu)
#define CapSense_STATUS_WDGT0_SHIFT       (0u)
#define CapSense_STATUS_WDGT0_MASK        (CapSense_STATUS_WDGT0_SIZE << CapSense_STATUS_WDGT0_SHIFT)

/* Bit 7: The CSD0 block status */
#define CapSense_STATUS_CSD0_SIZE         (0x00000001Lu)
#define CapSense_STATUS_CSD0_SHIFT        (7u)
#define CapSense_STATUS_CSD0_MASK         (CapSense_STATUS_CSD0_SIZE << CapSense_STATUS_CSD0_SHIFT)

/* Bits 8-14: The widget currently selected for CSD1 */
#define CapSense_STATUS_WDGT1_SIZE        (0x0000007FLu)
#define CapSense_STATUS_WDGT1_SHIFT       (8u)
#define CapSense_STATUS_WDGT1_MASK        (CapSense_STATUS_WDGT1_SIZE << CapSense_STATUS_WDGT1_SHIFT)

/* Bit 15: The CSD1 block status */
#define CapSense_STATUS_CSD1_SIZE         (0x00000001Lu)
#define CapSense_STATUS_CSD1_SHIFT        (15u)
#define CapSense_STATUS_CSD1_MASK         (CapSense_STATUS_CSD1_SIZE << CapSense_STATUS_CSD1_SHIFT)

/* Bit 16: The WIDGET BUSY flag status for CSD0 */
#define CapSense_STATUS_WDGT0_BUSY_SIZE   (0x00000001Lu)
#define CapSense_STATUS_WDGT0_BUSY_SHIFT  (16u)
#define CapSense_STATUS_WDGT0_BUSY_MASK   (CapSense_STATUS_WDGT0_BUSY_SIZE << CapSense_STATUS_WDGT0_BUSY_SHIFT)

/* Bit 17: The WIDGET BUSY flag status for CSD1 */
#define CapSense_STATUS_WDGT1_BUSY_SIZE   (0x00000001Lu)
#define CapSense_STATUS_WDGT1_BUSY_SHIFT  (17u)
#define CapSense_STATUS_WDGT1_BUSY_MASK   (CapSense_STATUS_WDGT1_BUSY_SIZE << CapSense_STATUS_WDGT1_BUSY_SHIFT)

/* Bits 18-23: Reserved */

/* Bits 24-31: CapSense component error code */
#define CapSense_STATUS_ERR_SIZE          (0x000000FFLu)
#define CapSense_STATUS_ERR_SHIFT         (24u)
#define CapSense_STATUS_ERR_MASK          (CapSense_STATUS_ERR_SIZE << CapSense_STATUS_ERR_SHIFT)


/* WD_STATIC_CONFIG bit fields */

/* Bit 0: The sense/Tx frequency selection: 0 - Common, 1 - Individual (per widget). */
#define CapSense_SNS_FREQ_SIZE            (0x00000001Lu)
#define CapSense_SNS_FREQ_SHIFT           (0u)
#define CapSense_SNS_FREQ_MASK            (CapSense_SNS_FREQ_SIZE << CapSense_SNS_FREQ_SHIFT)

/* Bit 1: Duplexing Enable/Disable for linear sliders. */
#define CapSense_DIPLEXING_SIZE           (0x00000001Lu)
#define CapSense_DIPLEXING_SHIFT          (1u)
#define CapSense_DIPLEXING_MASK           (CapSense_DIPLEXING_SIZE << CapSense_DIPLEXING_SHIFT)

/* Bit 2: The widget contains a sensor ganged to other sensors. */
#define CapSense_GANGED_SNS_SIZE          (0x00000001Lu)
#define CapSense_GANGED_SNS_SHIFT         (2u)
#define CapSense_GANGED_SNS_MASK          (CapSense_GANGED_SNS_SIZE << CapSense_GANGED_SNS_SHIFT)

/* Bit 3: Some pin from this widget is used by other sensors to make a ganged sensor. */
#define CapSense_SHARED_IO_SIZE           (0x00000001Lu)
#define CapSense_SHARED_IO_SHIFT          (3u)
#define CapSense_SHARED_IO_MASK           (CapSense_SHARED_IO_SIZE << CapSense_SHARED_IO_SHIFT)

/* Bit 4: The centroid position IIR filter Enable/Disable. */
#define CapSense_POS_IIR_FILTER_SIZE      (0x00000001Lu)
#define CapSense_POS_IIR_FILTER_SHIFT     (4u)
#define CapSense_POS_IIR_FILTER_MASK      (CapSense_POS_IIR_FILTER_SIZE << CapSense_POS_IIR_FILTER_SHIFT)

/* Bit 5: The centroid position median filter Enable/Disable. */
#define CapSense_POS_MEDIAN_FILTER_SIZE   (0x00000001Lu)
#define CapSense_POS_MEDIAN_FILTER_SHIFT  (5u)
#define CapSense_POS_MEDIAN_FILTER_MASK   (CapSense_POS_MEDIAN_FILTER_SIZE << CapSense_POS_MEDIAN_FILTER_SHIFT)

/* Bit 6: The centroid position average filter Enable/Disable. */
#define CapSense_POS_AVERAGE_FILTER_SIZE  (0x00000001Lu)
#define CapSense_POS_AVERAGE_FILTER_SHIFT (6u)
#define CapSense_POS_AVERAGE_FILTER_MASK  (CapSense_POS_AVERAGE_FILTER_SIZE << CapSense_POS_AVERAGE_FILTER_SHIFT)

/* Bit 7: The centroid position jitter filter Enable/Disable. */
#define CapSense_POS_JITTER_FILTER_SIZE   (0x00000001Lu)
#define CapSense_POS_JITTER_FILTER_SHIFT  (7u)
#define CapSense_POS_JITTER_FILTER_MASK   (CapSense_POS_JITTER_FILTER_SIZE << CapSense_POS_JITTER_FILTER_SHIFT)

/* Bit 8: The multiphase Tx scan Enable (CSX widgets only). */
#define CapSense_MULTIPHASE_TX_SIZE       (0x00000001Lu)
#define CapSense_MULTIPHASE_TX_SHIFT      (8u)
#define CapSense_MULTIPHASE_TX_MASK       (CapSense_MULTIPHASE_TX_SIZE << CapSense_MULTIPHASE_TX_SHIFT)

/* Bit 9: The centroid position adaptive IIR filter Enable/Disable. */
#define CapSense_AIIR_FILTER_SIZE         (0x00000001Lu)
#define CapSense_AIIR_FILTER_SHIFT        (9u)
#define CapSense_AIIR_FILTER_MASK         (CapSense_AIIR_FILTER_SIZE << CapSense_AIIR_FILTER_SHIFT)

/* Bit 10: Ballistic multiplier Enable/Disable. */
#define CapSense_BALLISTIC_SIZE           (0x00000001Lu)
#define CapSense_BALLISTIC_SHIFT          (10u)
#define CapSense_BALLISTIC_MASK           (CapSense_BALLISTIC_SIZE << CapSense_BALLISTIC_SHIFT)

/* Bit 11: 3x3 centroid Enable/Disable. */
#define CapSense_CENTROID_3X3_SIZE        (0x00000001Lu)
#define CapSense_CENTROID_3X3_SHIFT       (11u)
#define CapSense_CENTROID_3X3_MASK        (CapSense_CENTROID_3X3_SIZE << CapSense_CENTROID_3X3_SHIFT)

